[ {
  "building" : "Art and Design Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : false,
    "resources" : true
  },
  "c_info" : "Classes take place in a number of computer labs in the basement, as well as a lecture style room.",
  "r_info" : "There are several computer labs available for use, as well as the ability to rent/check out photography equipmen† for classes"
}
 , {
  "building" : "Blueridge Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : false,
    "resources" : false
  },
 "c_info" : "Blueridge Hall is a student housing building, but has a classroom on the first floor, that holds the occasional lecture."
}
, {
  "building" : "David King Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
  "c_info" : "Classes as well as some research opportunities, specifically in the Psychology Department are conducted here. SOMA Research is typically conducted in the basement of DK",
  "o_info" : "The Psychology department has its officies in David King, as well as the Department of Environmental Science and Policy."
}
, {
  "building" : "East Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "c_info" : "There are a number of classrooms in East, that are mainly used for smaller class experiences.",
  "o_info" : "The Robinson Professors as well as the Early Identification Program have offices in East Building."
}
, {
  "building" : "Enterprise Hall",
  "flags" : {
    "study" : true,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "There are a number of quiet spots for study, including on the second and third floor, in the area that runs over the walkway below. This is a peaceful place to get some work done. There are not any desks in this area so keep that in mind.",
 "c_info" : "Classroms are varied in Enterprise, there are both smaller classrooms and larger lecture halls located in this building.",
 "o_info" : "Offices in Enterprise include: Economics, Management, New Century College, and the Office of Student Academic Affairs."
}
 , {
  "building" : "Exploratory Hall",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "Exploratory has a number of places to study. On the first floor there is the perodic table room, where there are tables to work on, but this area is usually crowded during peak study times. On the second floor there are some study areas that are tucked inbetween some of the classrooms. Also the best place to study, weather permitting is on the third floor there is a balcony that has a number of tables and chairs to work on. There are not outlets out there so power management is necessary.",
 "f_info" : "Exploratory has a Pete's Coffee on the main floor by the entrance that leads toward Enterprise, and the Shenandoah Parking Deck.",
 "c_info" : "Classes are held throughout Exploratory, with a number of Labs on all of the floors, as well as several lecture halls on the lower level, as well as some collaborative classroom spaces.",
 "o_info" : "Offices for the Biology Department are located primarily in Exploratory."
}
 , {
  "building" : "Fenwick Library",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : false,
    "resources" : true
  },
 "s_info" : "Fenwick has some of the best study locations on campus, with a number of tables with comfortable chairs set up on each of the levels it is the go-to location for studying on campus. There are also study rooms which can be booked online. Each floor has a different silence level which gets quieter as you go up in the building, so if you need absolute silence while studying, the 4th floor is for you.",
 "f_info" : "Argo Tea is located in the lobby of Fenwick.",
 "r_info" : "While a great study location, Fenwick is first and foremost a Library. You can check out books and browse the other resources the library has to offer. Fenwick also has printing services available."
}
 , {
  "building" : "Finley Building",
  "flags" : {
    "study" : true,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "Finley has a great courtyard that has picknic tables set up which is a great quiet place to study, weather permitting.",
 "c_info" : "Finley has similar classrooms to East and West buildings, which are traditional classrooms for a smaller class size.",
 "o_info" : "The School of Public Policy is located in the Finley Building."
}
 , {
  "building" : "Innovation Hall",
  "flags" : {
    "study" : true,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "Innovation has a nice area on the top floor that has a number of tables, and several computer labs that would make for good study locations.",
 "c_info" : "The classrooms for Innovation include several large lecture halls, along with a number of smaller classrooms and some comptuer labs on the upper floors for classes.",
 "o_info" : "ITU support center is housed in Innovation, but other than this and some additional IT offices, there are no departmental offices located in Innovation."
}
 , {
  "building" : "Johnson Center",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : true,
    "resources" : true
  },
 "s_info" : "The JC has a number of tables on each and every floor that make for good locations to get some work done. There are also some study rooms on the upper floors that can be reserved online. Only downside to working in the JC is the noise, but with the food options readily available it is still a popular study location.",
 "f_info" : "In the JC: Freshens (convenient store), Panera Bread, Star Ginger, Steak n Shake, Garbanzo, Blaze Pizza, Chipotle, Indaroma, Red Hot n Blue, Starbucks.",
 "o_info" : "There are numerous offices in the JC, including: Study Abroad, Women and Gender Studies, African American Studies, Student Centers office and many more. For more information on specific offices check in at the Info Desk in the JC itself.",
 "r_info" : "On the main level of the Johnson Center is the Information Desk which is staffed to answer any questions you may have. Also ther is an Apple FCU bank branch, Barnes and Noble bookstore for Textbooks, supplies etc. There is a library with printing services, Student Centers office, and computer labs for use during operating hours." 
}
 , {
  "building" : "Krug Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "c_info" : "Similar to East and West, Krug has a number of classrooms that support small to medium sized traditional class type.",
 "o_info" : "Houses the Helen A. Kellar Institute and the English Language Institute."
}
 , {
  "building" : "Lecture Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : false,
    "resources" : false
  },
 "c_info" : "Lecture Hall contains one large lecture hall and 2 smaller classrooms."
}
 , {
  "building" : "Merten Hall",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 "s_info" : "Merten Hall has a nice lobby space between Panda Express and Einstein's Bagels, which has a number of couches and tables that are good for a quick study session before class, as there is relatively low traffic in the building itself.",
 "f_info" : "In Merten Hall is: Panda Express, Einstein's Bagels and Manhattan's Pizza.",
 "c_info" : "There are several classrooms on the first floor of Merten, which can hold a medium to larger sized class.",
 "o_info" : "Human Resources has their office in Merten Hall, as well as the Marketing section responsible for We Are Mason.",
 "r_info" : "There is an Information Desk in the lobby, as well as a UPS store between the Einstein's and Manhattan's."
}
 , {
  "building" : "Music/Theater Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : false,
    "resources" : false
  },
 "c_info" : "There are several classrooms of varying type in the lower level of Music Theater, with different Music and performing arts spaces in the upper levels of the building."
}
 , {
  "building" : "Nguyen Engineering Building",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 "s_info" : "There are several little tucked away areas with tables and chairs that can be used to study in the Engineering building, as well as on the lower floor there are some comfortable chairs and tables that can also be used to study.",
 "f_info" : "There is an Einstein's Bagel in the lower level.",
 "c_info" : "There are several classrooms on the lower level of Engineering, with on lecture hall, as well as several more traditional smaller scale classrooms.",
 "o_info" : "The Schools of Engineering and Computer Science have their offices in the Engineering building on the upper floors.",
 "r_info" : "Ther are a number of computer labs throughout the building, that can be used by students."
}
 , {
  "building" : "Peterson Hall",
  "flags" : {
    "study" : false,
    "food" : true,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "f_info" : "There is a Pete's Coffee located in Peterson Hall.",
 "c_info" : "Peterson is the newest building on GMU Fairfax campus, and there are a number of classrooms housed within.",
 "o_info" : "School of Social Work as well as the Nursing program have offices and classrooms in Peterson."
}
 , {
  "building" : "Planetary Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "c_info" : "Planetary is home to a number of classrooms on each of the floors, as well as labs for the physics department. This building is connected to Exploratory, which may cause confusion as to class locations.",
 "o_info" : "The Physics Department is housed in Planetary"
}
 , {
  "building" : "Research Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 "c_info" : "There is a large classroom on the first floor of Research Hall, as well as an abundance of office and research space.",
 "o_info" : "Offices in Research Hall include the College of Science and the Center for Earth Observing and Space Research.",
 "r_info" : "Research Hall is home to the GMU Observatory, which has a number of public talks and tours throughout the semester and summer, check their website for schedule and weather updates." 
}
 , {
  "building" : "Robinson B",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "c_info" : "Robinson B holds a large number of traditional classrooms with ideal class sizes of under 50. There are a couple larger and some that could hold no more than 25.",
 "o_info" : "The English Department is currently housed in Robinson, however all of the construction may change some locations in the future."
}
 , {
  "building" : "Sandbridge Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : false,
    "resources" : false
  },
 "c_info" : "Sandbridge is like Blueridge, in that it is a Student Housing building that has a single lecture hall on the first floor. The lecture room has its own entrance."
}
 , {
  "building" : "Southside",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : false,
    "resources" : false
  },
  "s_info" : "Southside dining hall is a decent place to study if you want to do so while grabbing a bite to eat. It can be loud and crowded, but still offers the ability to eat and study simultaneously.",
  "f_info" : "Southside is one of the three dining halls on campus."
}
 , {
  "building" : "Student Union Building I (SUB1)",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : true,
    "resources" : true
  },
  "s_info" : "SUB1 has a number of great places to study on the main floor there are a number of couches and tables, and then scattered upstairs are several tables and chairs that make for great study locations due to the low traffic and quiet atmosphere.",
  "f_info" : "SUB1 Food: Chick-fil-a, The Rathskeller, Akeno Sushi, Simply-to-go.",
  "o_info" : "Student Conduct office, the Card Office, Financial Aid, Student Accounts",
  "r_info" : "SUB1 has some of the best resources on campus. Inside is: Career Services, Counseling and Psychological Services (CAPS) and Student Support and Advocacy Center (SSAC)."
}
 , {
  "building" : "The HUB",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : true,
    "resources" : true
  },
  "s_info" : "The HUB has a number of tables set up for students to use, with some tables outside on the patio as well, which is a great place during the warm weather.",
  "f_info" : "WingZone is located on the Main floor of the HUB.",
  "o_info" : "the Hub is home to the office of Orientation and Family Planning.",
  "r_info" : "There is an information desk on the top floor of the HUB, and the Mail Room is on the bottom floor." 
}
 , {
  "building" : "West Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "c_info" : "Similar in layout to East Building West has a number of smaller classrooms.",
 "o_info" : "West houses the office of Education Services."
}
]
