[ {
  "building" : "Art and Design Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : false,
    "resources" : true
  },
  "c_info" : "Classes take place in a number of computer labs in the basement, as well as a lecture style room.",
  "r_info" : "There are several computer labs available for use, as well as the ability to rent/check out photography equipmen† for classes"
}
 , {
  "building" : "Blueridge Hall",
  "flags" : {
    "study" : false,
    "food" : true,
    "classes" : true,
    "offices" : false,
    "resources" : false
  },
 "c_info" : "Blueridge Hall is a student housing building, but has a classroom on the first floor, that holds the occasional lecture."
}
, {
  "building" : "David King Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
  "c_info" : "Classes as well as some research opportunities, specifically in the Psychology Department are conducted here. SOMA Research is typically conducted in the basement of DK",
  "o_info" : "The Psychology department has its officies in David King, as well as the Department of Environmental Science and Policy."
}
, {
  "building" : "East Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "c_info" : "There are a number of classrooms in East, that are mainly used for smaller class experiences.",
  "o_info" : "The Robinson Professors as well as the Early Identification Program have offices in East Building."
}
, {
  "building" : "Enterprise Hall",
  "flags" : {
    "study" : true,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "There are a number of quiet spots for study, including on the second and third floor, in the area that runs over the walkway below. This is a peaceful place to get some work done. There are not any desks in this area so keep that in mind.",
 "c_info" : "Classroms are varied in Enterprise, there are both smaller classrooms and larger lecture halls located in this building.",
 "o_info" : "Offices in Enterprise include: Economics, Management, New Century College, and the Office of Student Academic Affairs."
}
 , {
  "building" : "Exploratory Hall",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "Exploratory has a number of places to study. On the first floor there is the perodic table room, where there are tables to work on, but this area is usually crowded during peak study times. On the second floor there are some study areas that are tucked inbetween some of the classrooms. Also the best place to study, weather permitting is on the third floor there is a balcony that has a number of tables and chairs to work on. There are not outlets out there so power management is necessary.",
 "f_info" : "Exploratory has a Pete's Coffee on the main floor by the entrance that leads toward Enterprise, and the Shenandoah Parking Deck.",
 "c_info" : "Classes are held throughout Exploratory, with a number of Labs on all of the floors, as well as several lecture halls on the lower level, as well as some collaborative classroom spaces.",
 "o_info" : "Offices for the Biology Department are located primarily in Exploratory."
}
 , {
  "building" : "Fenwick Library",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : false,
    "resources" : true
  },
 "s_info" : "Fenwick has some of the best study locations on campus, with a number of tables with comfortable chairs set up on each of the levels it is the go-to location for studying on campus. There are also study rooms which can be booked online. Each floor has a different silence level which gets quieter as you go up in the building, so if you need absolute silence while studying, the 4th floor is for you.",
 "f_info" : "Argo Tea is located in the lobby of Fenwick.",
 "r_info" : "While a great study location, Fenwick is first and foremost a Library. You can check out books and browse the other resources the library has to offer. Fenwick also has printing services available."
}
 , {
  "building" : "Finley Building",
  "flags" : {
    "study" : true,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "Finley has a great courtyard that has picknic tables set up which is a great quiet place to study, weather permitting.",
 "o_info" : "The School of Public Policy is located in the Finley Building."
}
 , {
  "building" : "Innovation Hall",
  "flags" : {
    "study" : true,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 "s_info" : "Innovation has a nice area on the top floor that has a number of tables, and several computer labs that would make for good study locations.",
 "o_info" : "ITU support center is housed in Innovation, but other than this and some additional IT offices, there are no departmental offices located in Innovation."
}
 , {
  "building" : "Johnson Center",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : true,
    "resources" : true
  },
 "s_info" : "The JC has a number of tables on each and every floor that make for good locations to get some work done. There are also some study rooms on the upper floors that can be reserved online. Only downside to working in the JC is the noise, but with the food options readily available it is still a popular study location.",
 "f_info" : "In the JC: Freshens (convenient store), Panera Bread, Star Ginger, Steak n Shake, Garbanzo, Blaze Pizza, Chipotle, Indaroma, Red Hot n Blue, Starbucks.",
 "o_info" : "There are numerous offices in the JC, including: Study Abroad, Women and Gender Studies, African American Studies, Student Centers office and many more. For more information on specific offices check in at the Info Desk in the JC itself.",
 "r_info" : "On the main level of the Johnson Center is the Information Desk which is staffed to answer any questions you may have. Also ther is an Apple FCU bank branch, Barnes and Noble bookstore for Textbooks, supplies etc. There is a library with printing services, Student Centers office, and computer labs for use during operating hours." 
}
 , {
  "building" : "Krug Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : false
  },
 
}
 , {
  "building" : "Lecture Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Merten Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Music/Theater Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Nguyen Engineering Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Peterson Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Planetary Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Research Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Robinson B",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Sandbridge Hall",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "Southside",
  "flags" : {
    "study" : true,
    "food" : true,
    "classes" : false,
    "offices" : false,
    "resources" : false
  },
 
}
 , {
  "building" : "Student Union Building I (SUB1)",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "The HUB",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
 , {
  "building" : "West Building",
  "flags" : {
    "study" : false,
    "food" : false,
    "classes" : true,
    "offices" : true,
    "resources" : true
  },
 
}
